pwbf/RX64M_ETHERNET/r_t4_file_driver_rx/src/use_internal_mem/r_file_driver_internal.c
/*******************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only
* intended for use with Renesas products. No other uses are authorized. This
* software is owned by Renesas Electronics Corporation and is protected under
* all applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT
* LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
* AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.
* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS
* ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE
* FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR
* ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE
* BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software
* and to discontinue the availability of this software. By using this software,
* you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2014 Renesas Electronics Corporation. All rights reserved.
*******************************************************************************/
/*******************************************************************************
* File Name    : r_file_driver_internal.c
* Description  : This is the file driver code.
*******************************************************************************/
/*******************************************************************************
* History      : DD.MM.YYYY Version  Description
*              : 01.12.2014 1.00     First Release
*******************************************************************************/

/******************************************************************************
Includes <System Includes> , "Project Includes"
******************************************************************************/
#include "r_t4_file_driver_rx_config.h"

#if (SERVER_FILE_DRV_USE_INTERNAL==1) && (SERVER_FILE_DRV_USE_EXTERNAL==0)

#include <stdio.h>
#include <string.h>
#include "r_t4_file_driver_rx_if.h"

/******************************************************************************
Macro definitions
******************************************************************************/
#define FILE_CLOSED 0
#define FILE_OPENED 1

#define SERVER_CONTENTS_STORE_END_ADR     (SERVER_CONTENTS_STORE_HEAD_ADR + SERVER_CONTENTS_STORE_MEM_SIZE)

/******************************************************************************
Exported global variables and functions (to be accessed by other files)
******************************************************************************/

/******************************************************************************
Private global variables and functions
******************************************************************************/
typedef struct _file_info
{
    int32_t status;
    uint8_t *file_name;
    uint8_t *file_address;
    int32_t file_size;
    int32_t read_pointer;
    int32_t write_pointer;
    uint32_t attr;
}FILE_INFO;

static FILE_INFO finfo[SERVER_MAX_OPEN_FILE] = {0};

/* contents list */
static CONTENTS contents[SERVER_MAX_CONTENTS_LIST] = {SERVER_CONTENTS_LIST};
static uint16_t now_contents_num = SERVER_DEF_CONTENTS;

/* store memory */
static uint32_t store_mem_current_pos = 0; /* MAX:SERVER_CONTENTS_STORE_MEM_SIZE */

static int32_t recode_contents( uint8_t *buf, int32_t size );
static void delete_contents( uint32_t contents_num );

/******************************************************************************
Function Name   : file_open_sub
Description     : This function opens the file specified in its argument in
                  exclusive read mode and saves file management information
                  independently. It also specifies an ID value for this file
                  management information as the return value so that the web
                  server can reference the saved file management information by
                  ID. The saved file management information must be saved until
                  this ID value is passed to the file close function.
Arguments       : file_path -
                      input pointer to file path to open
                  mode_flag -
                      input Mode value of file open (FILE_WRITE or FILE_READ)
Return Value    : (-1) -
                      Error
                  (0) and positive integer -
                      The ID value for the opened file
******************************************************************************/
int32_t file_open_sub(uint8_t *file_path, uint8_t mode_flag)
{
    uint16_t index = 0;
    uint32_t i;

    /* search empty file structure */
    for (i = 0; i < SERVER_MAX_OPEN_FILE; i++)
    {
        if (finfo[i].status == FILE_CLOSED)
        {
            finfo[i].status = FILE_OPENED;
            index = i;
            break;
        }
    }
    if (i == SERVER_MAX_OPEN_FILE)
    {
        return -1;
    }

    /* search contents */
    for (i = 0; i < now_contents_num; i++)
    {
        if (!strcmp((char*)file_path, (char*)contents[i].file_name))
        {
            finfo[index].file_name     = (uint8_t*)contents[i].file_name;
            finfo[index].file_address  = contents[i].file_address;
            finfo[index].file_size     = contents[i].file_size;
            finfo[index].write_pointer = contents[i].file_size;
            finfo[index].attr          = contents[i].attr;
            break;
        }
    }

    /* The file name which wasn't in a contents list
       ( write request may come at next time.) */
    if (i == now_contents_num)
    {
//        if (i == 0)
//        {
//            finfo[index].status = FILE_CLOSED;
//            return -1;
//        }
        /* list over */
        if (i > (SERVER_MAX_CONTENTS_LIST - 1) )
        {
            finfo[index].status = FILE_CLOSED;
            return -1;
        }

