pwbf/RX64M_ETHERNET/r_t4_file_driver_rx/src/use_internal_mem/r_file_driver_internal.c
        /* memory over */
        if ( store_mem_current_pos >= SERVER_CONTENTS_STORE_MEM_SIZE )
        {
            return -1;
        }

        /* Short file name (8.3 format) */
        if (strlen((char*)file_path) > (1 + 8 + 1 + 3)) /* "/" + "file name" + "." + "extension" */
        {
            return -1;
        }

        strcpy((char*)contents[i].file_name, (char*)file_path);
        contents[i].file_address = (uint8_t*)(SERVER_CONTENTS_STORE_HEAD_ADR
                                              + store_mem_current_pos); /* The current address of memory area */
        contents[i].file_size    = 0;
        contents[i].attr         = FILE_ATTR_ARC;

        finfo[index].file_name     = contents[i].file_name;
        finfo[index].file_address  = contents[i].file_address;
        finfo[index].file_size     = NULL;
        finfo[index].attr          = FILE_ATTR_ARC;
        finfo[index].write_pointer = 0;
        now_contents_num++;
    }

    return index;
}


/******************************************************************************
Function Name   : file_open_sub
Description     : This function closes the file corresponding to the ID
                  specified by the argument and discards the file management
                  information.
Arguments       : file_id -
                      ID value of the file to close
Return Value    : (-1) -
                      Error
                  (0) -
                      Normal completion
******************************************************************************/
int32_t file_close_sub(int32_t file_id)
{
    if (file_id >= SERVER_MAX_OPEN_FILE)
    {
        return -1;
    }

    if (finfo[file_id].status == FILE_OPENED)
    {
        finfo[file_id].status = FILE_CLOSED;
        finfo[file_id].read_pointer = 0;
    }

    return 0;

}

/******************************************************************************
Function Name   : file_read_sub
Description     : This function reads the file corresponding to the ID value
                  passed as an argument and advances the file pointer by the
                  amount read. The file pointer is recorded in the file
                  management information for each ID value and is maintained
                  until the file close function is called.
Arguments       : file_id -
                      ID value of the file to read
                  buf -
                      Storage area for the file data read
                  read_size -
                      Size of file to read
Return Value    : (-1) -
                      Error
                  (0) and positive integer -
                      Data size of receiving
******************************************************************************/
int32_t file_read_sub(int32_t file_id, uint8_t *buf, int32_t read_size)
{
    int32_t read_byte = -1;

    if ( read_size < 0 )
    {
        return -1;
    }

    if (finfo[file_id].status == FILE_OPENED)
    {
        if (finfo[file_id].read_pointer < finfo[file_id].file_size)
        {
            memcpy(buf, finfo[file_id].file_address + finfo[file_id].read_pointer, read_size);
            finfo[file_id].read_pointer += read_size;

            /* Actual reading size setting */
            if (finfo[file_id].read_pointer < finfo[file_id].file_size)
            {
                read_byte = read_size;
            }
            else
            {
                read_byte = read_size - (finfo[file_id].read_pointer - finfo[file_id].file_size);
            }
        }
        else
        {
            read_byte = 0;
        }
    }
    return read_byte;
}

/******************************************************************************
Function Name   : file_write_sub
Description     : This function writes the file corresponding to the ID value
                  passed as an argument and advances the file pointer by the
                  amount write. The file pointer is recorded in the file
                  management information for each ID value and is maintained
                  until the file close function is called.
Arguments       : file_id -
                      ID value of the file to write
                  buf -
                      Storage area for the file data write
                  write_size -
                      Size of the file to write
Return Value    : (-1) -
                      Error
                  (0) -
                      Normal completion
******************************************************************************/
int32_t file_write_sub(int32_t file_id, uint8_t *buf, int32_t write_size)
{
    int32_t ret = -1;
    uint32_t i;

    if (finfo[file_id].attr != FILE_ATTR_ARC)
    {
        return -1;
    }

    if (finfo[file_id].status == FILE_OPENED)
    {
        /* search contents */
        for (i = 0; i < now_contents_num; i++)
        {
            if (!strcmp( (char*)finfo[file_id].file_name, (char*)contents[i].file_name))
            {
                /* Overwrite case */
                if (finfo[file_id].write_pointer != 0)
                {
                    /* contents size may change.
                       list reorganization.
                       a now data delete and a new data go back to the end of the line again. */
                    delete_contents(i);

                    /* A contents list is rewritten. */
                    contents[i].file_address = (uint8_t*)(SERVER_CONTENTS_STORE_HEAD_ADR
                                                          + store_mem_current_pos); /* The current address of memory area */
                    contents[i].file_size    = 0;

                    finfo[file_id].file_address  = contents[i].file_address;
                    finfo[file_id].write_pointer = 0;
                }

                if (recode_contents(buf, write_size) != 0)
                {
                    if (contents[i].file_size == 0)
                    {
                        /* file list decrement */
                        now_contents_num--;
                    }
                    return -1;
                }

