pwbf/RX64M_ETHERNET/r_t4_file_driver_rx/src/use_internal_mem/r_file_driver_internal.c
                contents[i].file_size += write_size;
                finfo[file_id].file_size = contents[i].file_size;
                ret = 0;
                break;
            }
        }
    }

    return ret;
}

/******************************************************************************
Function Name   : file_delete_sub
Description     : This function deletes the file corresponding to the ID
                  specified by the argument. The specification of file is full
                  path from root directory.
Arguments       : file_path -
                      pointer to file path to delete
Return Value    : (-1) -
                      Error
                  (0) -
                      Normal completion
******************************************************************************/
int32_t file_delete_sub(uint8_t *file_path)
{
    int32_t ret = -1;
    uint32_t i;

    /* search contents */
    for (i = 0; i < now_contents_num; i++)
    {
        if (!strcmp((char*)file_path, (char*)contents[i].file_name))
        {
            if (contents[i].attr == FILE_ATTR_RDO)
            {
                return -1;
            }

            /* memory area delete & update */
            delete_contents(i);

            /* contents list delete & update */
            memcpy( &contents[i], &contents[i+1], ((now_contents_num - i)*sizeof(CONTENTS)) );

            now_contents_num--;
            ret = 0;
            break;
        }
    }

    return ret;
}

/******************************************************************************
Function Name   : make_dir_sub
Description     : This function makes the directory. The argument is specified
                  in full path from root directory.
Arguments       : dir_path -
                      pointer to file path to make
Return Value    : (-1) -
                      Error
                  (0) -
                      Normal completion
******************************************************************************/
int32_t make_dir_sub(uint8_t *dir_path)
{
    return 0;
}

/******************************************************************************
Function Name   : remove_dir_sub
Description     : This function removes the directory. The argument is
                  specified in full path from root directory.
Arguments       : dir_path -
                      pointer to file path to remove
Return Value    : (-1) -
                      Error
                  (0) -
                      Normal completion
******************************************************************************/
int32_t remove_dir_sub(uint8_t *dir_path)
{
    return 0;
}

/******************************************************************************
Function Name   : change_dir_sub
Description     : This function sets current directory using specified argument.
                  The argument specifies directory path in full path.
                  Information of current directory is managed in each
                  communication endpoint.
Arguments       : dir_path -
                      Pointer to directory path
Return Value    : (-1) -
                      Error
                  (0) -
                      Normal completion
******************************************************************************/
int32_t change_dir_sub(uint8_t *dir_path)
{
    return 0;
}

/******************************************************************************
Function Name   : file_exist_sub
Description     : This function verifies the file or directory existing.
                  The argument is specified in full path from root directory.
Arguments       : file_path -
                      Pointer to file or directory path
Return Value    : (-1) -
                      Not exist
                  (0) -
                      Exist
******************************************************************************/
int32_t file_exist_sub(uint8_t *file_path)
{
    return 0;
}

/******************************************************************************
Function Name   : file_rename_sub
Description     : This function renames the file specified first argument to
                  second argument. These arguments are specified in full path
                  from root directory.
Arguments       : old_name -
                      pointer to target file name
                  new_name -
                      pointer to after file name
Return Value    : (-1) -
                      Error
                  (0) -
                      Normal completion
******************************************************************************/
int32_t file_rename_sub(uint8_t *old_name, uint8_t *new_name)
{
    int32_t ret = -1;
    uint32_t i, j;

    /* Short file name (8.3 format) */
    if (strlen((char*)new_name) > (1 + 8 + 1 + 3)) /* "/" + "file name" + "." + "extension" */
    {
        return -1;
    }

    /* search contents */
    for (i = 0; i < now_contents_num; i++)
    {
        if (!strcmp((char*)old_name, (char*)contents[i].file_name))
        {
            if (contents[i].attr == FILE_ATTR_RDO)
            {
                return -1;
            }
            /* rename */
            strcpy((char*)contents[i].file_name, (char*)new_name);
            for (j = 0; j < SERVER_MAX_OPEN_FILE; j++)
            {
                if (!strcmp( (char*)finfo[j].file_name, (char*)old_name))
                {
                    finfo[j].file_name = (uint8_t*)contents[i].file_name;
                }
            }
            ret = 0;
        }
    }

    return ret;
}

/******************************************************************************
Function Name   : get_file_size_sub
Description     : This function reads the file management information for the
                  file corresponding to the ID value specified as an argument
                  and returns the file size.
Arguments       : file_id -
                      ID value of the file to read
Return Value    : (-1) -
                      Error
                  (0) and positive integer -
                      File size
******************************************************************************/
int32_t get_file_size_sub(int32_t file_id)
{
    if (finfo[file_id].status == FILE_OPENED)
    {
        return finfo[file_id].file_size;
    }
    return -1;
}

