pwbf/RX64M_ETHERNET/r_t4_file_driver_rx/src/use_internal_mem/r_file_driver_internal.c
/******************************************************************************
Function Name   : get_file_list_info_sub
Description     : This function writes the file list stored at the directory
                  path specified as an argument to a file list structure.
Arguments       : dir_path -
                      pointer to directory path to read
                  file_list -
                      pointer to file list to store.
                      This function stores �e\0�f to end of structure
                  num_file_list -
                      Max number of file list to read at one time
                  read_index -
                      Index of read starting
Return Value    : (-1) -
                      Error
                  (0) and positive integer -
                      Number of file
******************************************************************************/
int32_t get_file_list_info_sub(uint8_t *dir_path, FILE_LIST *file_list, uint32_t num_file_list, int32_t read_index)
{
    uint8_t    tmp_path[FILE_MAX_NAME_SIZE];
    int32_t    i;
    size_t     ln;

    /* delete '/' in end of line */
    tmp_path[0] = '\0';
    strcpy((char *)tmp_path, (const char *)dir_path);
    ln = strlen((char*)tmp_path);
    if (tmp_path[ln-1] == '/')
    {
        tmp_path[ln-1] = '\0';
    }

    /* root directory only */
    if (strlen((char*)tmp_path) != 0)
    {
        return -1;
    }

    if ( 0 > read_index )
    {
        return -1;
    }

    for (i = read_index; i < now_contents_num; i++, file_list++)
    {
        if (contents[i].file_name[0] == 0)
        {
            break;
        }
        strcpy((char*)file_list->file_name, (char*)contents[i].file_name + 1);
        file_list->file_size = contents[i].file_size;
        file_list->file_attr = contents[i].attr;
        get_file_info(0, &file_list->date_info);
    }

    return (i - read_index);
}

/******************************************************************************
Function Name   : get_file_info_sub
Description     : This function reads the file management information for the
                  file corresponding to the ID value specified as an argument
                  and writes the file date information to a date information
                  structure.
Arguments       : file_id -
                      ID value of the file to read
                  date_info -
                      pointer to information of date structure to store
Return Value    : (-1) -
                      Error
                  (0) -
                      Normal completion
******************************************************************************/
int32_t get_file_info_sub(int32_t file_id, DATE_INFO *date_info)
{
    date_info->year = 2012;
    strcpy((char *)date_info->month, "Oct");
    date_info->day = 17;
    strcpy((char *)date_info->day_of_the_week, "Wed");
    date_info->hour = 20;
    date_info->min  = 0;
    date_info->sec  = 0;
    return 0;
}

/******************************************************************************
Function Name   : R_server_file_drv_drive_regist
Description     : drive number registration
Arguments       : drive -
                        0 - VOLUMES : drive number
                        0xff        : drive information reset(drive name isn't added to the path.)
Return Value    : (-1) -
                      Error or unsupported
                  (0) -
                      Normal completion
******************************************************************************/
int32_t R_server_file_drv_drive_regist_sub(uint8_t drive)
{
    /* unsupported */
    return -1;
}


/******************************************************************************
Local Function
******************************************************************************/

/******************************************************************************
Function Name   : recode_contents
Description     : the contents data is written in a Memory area.
Arguments       : buf -
                      pointer to contents data
                  size -
                      contents data size
Return Value    : (-1) -
                      Error
                  (0) -
                      Normal completion
******************************************************************************/
static int32_t recode_contents( uint8_t *buf, int32_t size )
{
    if ( (store_mem_current_pos + size) > SERVER_CONTENTS_STORE_MEM_SIZE )
    {
        return -1;
    }
    memcpy( (char*)(SERVER_CONTENTS_STORE_HEAD_ADR + store_mem_current_pos), buf, size );
    store_mem_current_pos += size;

    return 0;
}

/******************************************************************************
Function Name   : delete_contents
Description     : memory area delete and  close up
Arguments       : contents_num - List number
Return Value    : none
******************************************************************************/
static void delete_contents( uint32_t contents_num )
{
    uint32_t i;
    uint32_t delete_size = 0;
    uint8_t* delete_addr = 0;

    /* memory area delete & update */
    if ( (SERVER_CONTENTS_STORE_HEAD_ADR <= contents[contents_num].file_address)
            && (contents[contents_num].file_address < SERVER_CONTENTS_STORE_END_ADR) )
    {
        /* memory area delete and  close up */
        delete_size = contents[contents_num].file_size;
        delete_addr = contents[contents_num].file_address;
        memcpy( contents[contents_num].file_address,
                (contents[contents_num].file_address + delete_size),
                ((SERVER_CONTENTS_STORE_HEAD_ADR + store_mem_current_pos) - (contents[contents_num].file_address + delete_size)) );
        store_mem_current_pos -= delete_size;

        /* file address Infomation modify */
        for (i = 0; i < now_contents_num; i++)
        {
            if ( (delete_addr < contents[i].file_address)
                    && (contents[i].file_address < SERVER_CONTENTS_STORE_END_ADR) )
            {
                contents[i].file_address -= delete_size;
            }
        }
    }
}

#endif // (SERVER_FILE_DRV_USE_INTERNAL==1) && (SERVER_FILE_DRV_USE_EXTERNAL==0)
/******************************************************************************
End of file
******************************************************************************/
